{
  "architectures": [
    "Qwen3NextForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attn_output_gate": true,
  "bos_token_id": 248044,
  "dtype": "bfloat16",
  "eos_token_id": 248044,
  "full_attention_interval": 4,
  "head_dim": 256,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "layer_types": [
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention"
  ],
  "linear_conv_kernel_dim": 4,
  "linear_key_head_dim": 128,
  "linear_num_key_heads": 16,
  "linear_num_value_heads": 32,
  "linear_value_head_dim": 128,
  "mamba_ssm_dtype": "float32",
  "max_position_embeddings": 262144,
  "model_type": "qwen3_next",
  "moe_intermediate_size": 512,
  "mtp_num_hidden_layers": 1,
  "mtp_use_dedicated_embeddings": false,
  "num_attention_heads": 16,
  "num_experts": 256,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 40,
  "num_key_value_heads": 2,
  "output_router_logits": false,
  "pad_token_id": 248044,
  "partial_rotary_factor": 0.25,
  "quantization_config": {
    "bits": 4,
    "checkpoint_format": "gptq",
    "desc_act": false,
    "dynamic": {
      "-:.*attn.*": {},
      "-:.*mlp\\.gate$": {},
      "-:.*mtp.*": {},
      "-:.*shared_expert.*": {},
      "-:.*visual.*": {},
      "lm_head": {},
      "model.language_model.embed_tokens": {}
    },
    "format": "gptq",
    "group_size": 128,
    "lm_head": false,
    "meta": {
      "act_group_aware": true,
      "auto_forward_data_parallel": true,
      "damp_auto_increment": 0.01,
      "damp_percent": 0.05,
      "fallback": {
        "smooth": null,
        "strategy": "rtn",
        "threshold": "0.5%"
      },
      "foem": null,
      "gc_mode": "interval",
      "gptaq": null,
      "hessian": {
        "chunk_bytes": null,
        "chunk_size": null,
        "staging_dtype": "float32"
      },
      "mock_quantization": false,
      "mse": 0.0,
      "offload_to_disk": true,
      "offload_to_disk_path": "./gptqmodel_offload/yikdaazd-eazekokx/",
      "pack_impl": "cpu",
      "quantizer": [
        "gptqmodel:6.0.3"
      ],
      "static_groups": false,
      "true_sequential": true,
      "uri": "https://github.com/modelcloud/gptqmodel",
      "vram_strategy": "balanced",
      "wait_for_submodule_finalizers": false
    },
    "method": "gptq",
    "pack_dtype": "int32",
    "quant_method": "gptq",
    "sym": true
  },
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "partial_rotary_factor": 0.25,
    "rope_theta": 10000000,
    "rope_type": "default"
  },
  "router_aux_loss_coef": 0.001,
  "shared_expert_intermediate_size": 512,
  "tie_word_embeddings": false,
  "transformers_version": "5.5.4",
  "use_cache": true,
  "vocab_size": 248320
}
